uhnp/src/InformationRegisters/ОчередьЧековККТ/ОчередьЧековККТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьЧековККТ</name>
  <resources>
    <name>СтатусЧека</name>
    <type>
      <types>EnumRef.СтатусЧекаККТВОчереди</types>
    </type>
  </resources>
  <resources>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Организация</name>
    <type>
      <types>DefinedType.ОрганизацияБПО</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>СистемаНалогообложения</name>
    <type>
      <types>EnumRef.ТипыСистемНалогообложенияККТ</types>
    </type>
  </resources>
  <resources>
    <name>ТорговыйОбъект</name>
    <type>
      <types>DefinedType.ТорговыйОбъектБПО</types>
    </type>
  </resources>
  <resources>
    <name>ТипДокумента</name>
    <type>
      <types>EnumRef.ТипыФискальныхДокументовККТ</types>
    </type>
  </resources>
  <resources>
    <name>ТипРасчета</name>
    <type>
      <types>EnumRef.ТипыРасчетаДенежнымиСредствами</types>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </resources>
  <resources>
    <name>ДанныеЧека</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ТекстОшибки</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Содержание</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ОборудованиеККТ</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </resources>
  <resources>
    <name>СубъектПерсональныхДанных</name>
    <type>
      <types>DefinedType.СубъектПерсональныхДанныхБПО</types>
    </type>
  </resources>
  <resources>
    <name>ТипПакетнойОперации</name>
    <type>
      <types>EnumRef.ТипыПакетнойОперацииВОчередиЧеков</types>
    </type>
  </resources>
  <resources>
    <name>ЭквайринговыйТерминал</name>
    <type>
      <types>CatalogRef.ПодключаемоеОборудование</types>
    </type>
  </resources>
  <resources>
    <name>ПараметрыПакетнойОперации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>РезультатПакетнойОперации</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>КассаККМ</name>
    <type>
      <types>DefinedType.КассаБПО</types>
    </type>
  </resources>
  <resources>
    <name>СтатусыОперацийВСервисеОблачныхКасс</name>
    <type>
      <types>EnumRef.СтатусыОперацийВСервисеОблачныхКасс</types>
    </type>
  </resources>
  <dimensions>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.ОснованиеФискальнойОперацииБПО</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ИдентификаторЗаписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

uhnp/src/InformationRegisters/ОчередьЧековККТ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.УправлениеДоступом
// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
//
// Параметры:
//  Ограничение - Структура:
//    * Текст                             - Строка - ограничение доступа для пользователей.
//                                          Если пустая строка, значит, доступ разрешен.
//    * ТекстДляВнешнихПользователей      - Строка - ограничение доступа для внешних пользователей.
//                                          Если пустая строка, значит, доступ запрещен.
//    * ПоВладельцуБезЗаписиКлючейДоступа - Неопределено - определить автоматически.
//                                        - Булево - если Ложь, то всегда записывать ключи доступа,
//                                          если Истина, тогда не записывать ключи доступа,
//                                          а использовать ключи доступа владельца (требуется,
//                                          чтобы ограничение было строго по объекту-владельцу).
//   * ПоВладельцуБезЗаписиКлючейДоступаДляВнешнихПользователей - Неопределено, Булево - также
//                                          как у параметра ПоВладельцуБезЗаписиКлючейДоступа.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Менеджер = "РегистрСведений.ОчередьЧековККТ";
	МенеджерОборудованияВызовСервераПереопределяемый.ПриЗаполненииОграниченияДоступа(Менеджер, Ограничение);
	
КонецПроцедуры
// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОчиститьРегистрДоДаты(ДатаОчистки) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// АПК: 1328-выкл
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОчередьЧековККТ.ИдентификаторЗаписи КАК ИдентификаторЗаписи,
		|	ОчередьЧековККТ.ДокументОснование КАК ДокументОснование
		|ИЗ
		|	РегистрСведений.ОчередьЧековККТ КАК ОчередьЧековККТ
		|ГДЕ
		|	ОчередьЧековККТ.Дата < &ДатаОчистки";
	
	Запрос.УстановитьПараметр("ДатаОчистки", ДатаОчистки);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОчередьЧековККТ.СоздатьНаборЗаписей();
	Выборка      = РезультатЗапроса.Выбрать();
	Если ОбщегоНазначенияБПОПовтИсп.РежимЗамещенияДоступен() Тогда
		Пока Выборка.Следующий() Цикл
			ЗаполнитьЗначенияСвойств(НаборЗаписей.Добавить(), Выборка);
		КонецЦикла;
		НаборЗаписей.Записать(ОбщегоНазначенияБПОПовтИсп.РежимЗамещенияУдаление());
	Иначе
		Пока Выборка.Следующий() Цикл
			НаборЗаписей.Очистить();
			НаборЗаписей.Отбор.ИдентификаторЗаписи.Установить(Выборка.ИдентификаторЗаписи);
			НаборЗаписей.Записать(Истина);
		КонецЦикла;
	КонецЕсли;
	// АПК: 1328-вкл
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
